/* matrix average comparison */
#include <stdio.h>           //Βιλιοθήκη για είσοδο/έξοδο λειτουργιών(printf,scanf)  
#include <string.h>	      //Βιβλιοθήκη χειρισμού συμβ/ρών(strcmp:σύγκριση δύο συμβολοσειρών) 

#define ROWS 4              //Ορισμός σταθεράς για τον αριθμό των γραμμμων  του πίνακα              
#define COLS 5	             //Ορισμός σταθεράς για τον αριθμό των στηλών του πίνακα  

int main() {
    int PIN[ROWS][COLS];             //Δήλωση δισδιάστατου πίνακα ακεραίων
    int I,j;		              //Δήλωση μεταβλητών για δείκτες γραμμών/στηλών αντίστοιχα
    double ES,EX;		      //Μεταβλητές μέσων όρων εσωτερικών/εξωτερικών στοιχείων 
    int sum_ES = 0, sum_EX = 0;    //Αρχικοποίηση αθροισμάτων εσωτερικών/εξωτερικών στοιχείων
    int count_ES = 0, sum_EX = 0;  //Αρχικοποίηση πλήθους εσωτερικών/εξωτερικών στοιχείων 
    int temp;			     //Προσωρινή μεταβλητή για την εισαγωγή τιμής
    int valid;			     //Μεταβλητή για έλεγχο εγκυρότητας τιμών 
    char choice[4]; 		     //Μεταβλητή για την επιλογή του χρήστη
    
    //Εισαγωγή στοιχείων στον πίνακα και έλεγχος εγκυρότητας στοιχείων 
    do{
       valid = 1;
	     for (i = 0; i < ROWS; i++){
 	          for(j = 0; j < COLS; j++){
		            do{
		               printf(“Δώσε το στοιχείο του πίνακα(θετικός αριθμός) στη θέση[%d][%d]: ”,i,j);
		               if(scanf(“%d”, &temp) != 1 || temp <= 0) {    //ελέγχουμε για θετική τιμή
		                  printf(“O αριθμός πρέπει να είναι θετικός.\n”);
		                  while (getchar() != ‘\n’ );   //Ελεγχος χαρακτήρα εισόδου και καθαρισμός 
							                                        σε περίπτωση εισαγωγής μη θετικού αριθμού//
                   } else {
	                      PIN[i][j] = temp;           //Αποθήκευση τιμής στον πίνακα
	                      break;                      //Διακοπή εσωτερικού βρόχου
                   }
                 } while (1)			/*ο βρόχος συνεχίζει να εκτελείται για όσο η συνθήκη 
				                            είναι αληθής.*/

                 /*ελέγχουμε εαν έχουμε φτάσει στην θέση όπου ο πίνακας δεν έχει ακόμα
                    εσωτερικά στοιχεία και ρωτάμε τον χρήστη εαν θέλει να συνεχίσει.*/
                 if (i == 1 && j==4){
                     printf(“Παρακαλώ πληκτρολογίστε ‘yes’ ή ‘no’ για να συνεχίσετε ή να
                            σταματήσετε το τρέχον πρόγραμμα(yes/no):  ”);
                     scanf(“$s”, choise”);      /*χρησιμοποιούμε το “%s” για την ανάγνωση/εμφάνιση 
						                                      Συμβολοσειρών(strings)*/
		                 if(strcmp(choice, “no”) ==0) {    //ελέγχουμε εαν ο χρήστης επέλεξε ‘no’.    
			                  if(!(ROWS > 2 && COLS > 2)){   /*ελέγχουμε εάν ο πίνακας έχει εσωτερικά
							                                          στοιχεία.*/
                        }
                        printf(“Ο πίνακας δεν έχει εσωτερικά στοιχεία.\n”);
                        Return 0;
                      }
                  }
              }
         }
    } while(!valid);
    
     // Εμφάνιση ακολουθίας 
     For(i=o; i < ROWS; i++){				//Διατρέχουμε τις γραμμές του πίνακα
	       For(j=0; j < COLS; j++){			//Διατρέχουμε τις στήλες του πίνακα
 	           printf(“%4d”, PIN[i][j]); 		//Εμφανίζουμε την τιμή του στοιχείου
	       }
	       print(“\n”);  					//Εμφανίζουμε νέα γραμμή
     }
    
    //Υπολογισμός μέσου όρου εσωτερικών και εξωτερικών στοιχείων 
    for (i = 0; i < ROWS; i++){			//Διατρέχουμε τις γραμμές του πίνακα
	       for(j = 0; j < COLS; j++){			//Διατρέχουμε τις στήλες του πίνακα
	           if(i == 0 || i== ROWS – 1 || j==0 || j== COLS -1){  /*Ελεγχος εαν το στοιχείο ειναι
								                                                   εξωτερικό*/
		            sum_EX += PIN[i][j];			/*Προσθέτουμε την τιμή στο άθροισμα 
						  	                            εξωτερικών στοιχείων*/
		            count_EX++;		            //αυξάνουμε το πλήθος  των εξωτερικών στοιχειων
             } else{
	                  sum_ES += PIN[i][j];	    /* Προσθέτουμε την τιμή στο άθροισμα των
						                                      εσωτερικών στοιχείων */
	                  count_ES++;	           //αυξάνουμε το πλήθος  των εσωτερικών στοιχειων
             }
         }
    }
    
    if(count_ES > 0){				    //ελέγχουμε εαν υπάρχουν εσωτεικά στοιχεία 
	      ES = (double)sum_ES / count_ES;	    //Υπολογισμός μέσου όρου εσωτερικών στοιχείων
    } else{
	      ES = 0;				    //θέτουμε τον μέσο όρο εσωτερικών στοιχείων σε 0
    }
    
    if(count_EX > 0){				    //ελέγχουμε εαν υπάρχουν εξωτερικά στοιχεία
	      EX = (double)sum_EX / count_EX;	    //Υπολογισμός μέσου όρου εξωτερικών στοιχείων
    } else{
	      EX = 0;				    //θέτουμε τον μέσο όρο εξωτερικών στοιχείων σε 0
    }

    // Σύγκριση και εμφάνιση των μεσων όρων  
    if(ES > EX){				    //ελέγχουμε εάν ο μέσος όρος εσωτερικών 
						                  στοιχείων ειναι μεγαλύτερος //
	     printf(“O μέσος όρος των εσωτερικών στοιχείων (%.2f)είναι μεγαλύτερος του μέσου όρου 
          των εξωτερικών στοιχείων (%.2f) του πίνακα.\n”, ES, EX);
    } else if(EX > ES)	{			    //ελέγχουμε εάν ο μέσος όρος εξωτερικών 
						                         στοιχείων ειναι μεγαλύτερος //
       printf(“Ο μέσος όρος των εξτερικών στοιχείων (%.2f) είναι μεγαλύτερος του μέσου όρου
              των εσωτερικών στοιχείων (%.2f) του πίνακα.n\”,EX, ES);
    } else {					   //ελέγχουμε εάν οι μέσοι όροι είναι ίσοι
	      printf(“Οι μέσοι όροι των εσωτερικών και εξωατερικών  (%.2f) είναι ίσοι.\n”, ES);
    }

    return 0;
}


------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
